Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F3DISCOVERY.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                   |I2C1|I2C2|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|ADC1 |TIM (PWM)                                 |USB|RCC       |SYS           
PA0 , // |B1 [Blue PushButton]          |    |    |     |     |     |      |      |      |*IN1 |*TIM2_CH1                                 |   |          |              
PA1 , // |                              |    |    |     |     |     |      |      |      |*IN2 |*TIM15_CH1N *TIM2_CH2                     |   |          |              
PA2 , // |                              |    |    |     |     |     |      |*TX   |      |*IN3 |*TIM2_CH3 +TIM15_CH1                      |   |          |              
PA3 , // |                              |    |    |     |     |     |      |*RX   |      |*IN4 |*TIM2_CH4 +TIM15_CH2                      |   |          |              
PA4 , // |                              |    |    |     |     |     |      |      |      |     |+TIM3_CH2                                 |   |          |              
PA5 , // |SPI1_SCK [L3GD20_SCL/SPC]     |    |    |*SCK |     |     |      |      |      |     |+TIM2_CH1                                 |   |          |              
PA6 , // |SPI1_MISO [L3GD20_SA0/SDO]    |    |    |*MISO|     |     |      |      |      |     |+TIM3_CH1 *TIM16_CH1                      |   |          |              
PA7 , // |SPI1_MISO [L3GD20_SDA/SDI/SDO]|    |    |*MOSI|     |     |      |      |      |     |+TIM1_CH1N *TIM8_CH1N +TIM3_CH2 *TIM17_CH1|   |          |              
PA8 , // |                              |    |    |     |     |     |      |      |      |     |+TIM1_CH1                                 |   |          |              
PA9 , // |                              |    |+SCL|     |     |     |+TX   |      |      |     |+TIM2_CH3 +TIM1_CH2                       |   |          |              
PA10, // |                              |    |+SDA|     |     |     |+RX   |      |      |     |+TIM2_CH4 +TIM1_CH3                       |   |          |              
PA11, // |DM                            |    |    |     |     |     |      |      |      |     |+TIM1_CH1N +TIM1_CH4 +TIM4_CH1            |*DM|          |              
PA12, // |DP                            |    |    |     |     |     |      |      |      |     |+TIM1_CH2N +TIM4_CH2 +TIM16_CH1           |*DP|          |              
PA13, // |SWDIO                         |    |    |     |     |     |      |      |      |     |*TIM16_CH1N +TIM4_CH3                     |   |          |*JTMS-SWDIO   
PA14, // |SWCLK                         |*SDA|    |     |     |     |      |+TX   |      |     |+TIM8_CH2                                 |   |          |*JTCK-SWCLK   
PA15, // |                              |*SCL|    |     |     |     |      |+RX   |      |     |+TIM8_CH1 +TIM2_CH1                       |   |          |*JTDI         
PB0 , // |                              |    |    |     |     |     |      |      |      |     |*TIM8_CH2N +TIM3_CH3 *TIM1_CH2N           |   |          |              
PB1 , // |                              |    |    |     |     |     |      |      |      |     |+TIM1_CH3N *TIM8_CH3N +TIM3_CH4           |   |          |              
PB2 , // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PB3 , // |SWO                           |    |    |+SCK |     |+SCK |      |+TX   |      |     |+TIM8_CH1N +TIM2_CH2                      |   |          |*JTDO-TRACESWO
PB4 , // |                              |    |    |+MISO|     |+MISO|      |+RX   |      |     |+TIM8_CH2N +TIM3_CH1 +TIM16_CH1           |   |          |*NJTRST       
PB5 , // |                              |    |    |+MOSI|     |+MOSI|      |      |      |     |+TIM3_CH2 +TIM8_CH3N +TIM17_CH1           |   |          |              
PB6 , // |I2C1_SCL [LSM303DLHC_SCL]     |+SCL|    |     |     |     |+TX   |      |      |     |+TIM8_CH1 +TIM16_CH1N +TIM4_CH1           |   |          |              
PB7 , // |I2C1_SDA [LSM303DLHC_SDA]     |+SDA|    |     |     |     |+RX   |      |      |     |*TIM17_CH1N +TIM3_CH4 +TIM4_CH2           |   |          |              
PB8 , // |                              |+SCL|    |     |     |     |      |      |      |     |+TIM8_CH2 +TIM4_CH3 +TIM16_CH1            |   |          |              
PB9 , // |                              |+SDA|    |     |     |     |      |      |      |     |+TIM4_CH4 +TIM17_CH1 +TIM8_CH3            |   |          |              
PB10, // |                              |    |    |     |     |     |      |      |*TX   |     |+TIM2_CH3                                 |   |          |              
PB11, // |                              |    |    |     |     |     |      |      |+RX   |     |+TIM2_CH4                                 |   |          |              
PB12, // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PB13, // |                              |    |    |     |+SCK |     |      |      |      |     |+TIM1_CH1N                                |   |          |              
PB14, // |                              |    |    |     |*MISO|     |      |      |      |     |+TIM1_CH2N +TIM15_CH1                     |   |          |              
PB15, // |                              |    |    |     |*MOSI|     |      |      |      |     |+TIM1_CH3N +TIM15_CH1N +TIM15_CH2         |   |          |              
PC0 , // |                              |    |    |     |     |     |      |      |      |*IN6 |                                          |   |          |              
PC1 , // |                              |    |    |     |     |     |      |      |      |*IN7 |                                          |   |          |              
PC2 , // |                              |    |    |     |     |     |      |      |      |*IN8 |                                          |   |          |              
PC3 , // |                              |    |    |     |     |     |      |      |      |*IN9 |                                          |   |          |              
PC4 , // |                              |    |    |     |     |     |*TX   |      |      |     |                                          |   |          |              
PC5 , // |                              |    |    |     |     |     |*RX   |      |      |     |                                          |   |          |              
PC6 , // |                              |    |    |     |     |     |      |      |      |     |*TIM8_CH1 +TIM3_CH1                       |   |          |              
PC7 , // |                              |    |    |     |     |     |      |      |      |     |+TIM3_CH2 *TIM8_CH2                       |   |          |              
PC8 , // |                              |    |    |     |     |     |      |      |      |     |+TIM3_CH3 *TIM8_CH3                       |   |          |              
PC9 , // |                              |    |    |     |     |     |      |      |      |     |+TIM3_CH4 *TIM8_CH4                       |   |          |              
PC10, // |                              |    |    |     |     |*SCK |      |      |+TX   |     |+TIM8_CH1N                                |   |          |              
PC11, // |                              |    |    |     |     |*MISO|      |      |+RX   |     |+TIM8_CH2N                                |   |          |              
PC12, // |                              |    |    |     |     |*MOSI|      |      |      |     |+TIM8_CH3N                                |   |          |              
PC13, // |                              |    |    |     |     |     |      |      |      |     |*TIM1_CH1N                                |   |          |              
PC14, // |OSC32_IN                      |    |    |     |     |     |      |      |      |     |                                          |   |*OSC32_IN |              
PC15, // |OSC32_OUT                     |    |    |     |     |     |      |      |      |     |                                          |   |*OSC32_OUT|              
PD0 , // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PD1 , // |                              |    |    |     |     |     |      |      |      |     |+TIM8_CH4                                 |   |          |              
PD2 , // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PD3 , // |                              |    |    |     |     |     |      |      |      |     |+TIM2_CH1                                 |   |          |              
PD4 , // |                              |    |    |     |     |     |      |      |      |     |+TIM2_CH2                                 |   |          |              
PD5 , // |                              |    |    |     |     |     |      |+TX   |      |     |                                          |   |          |              
PD6 , // |                              |    |    |     |     |     |      |+RX   |      |     |+TIM2_CH4                                 |   |          |              
PD7 , // |                              |    |    |     |     |     |      |      |      |     |+TIM2_CH3                                 |   |          |              
PD8 , // |                              |    |    |     |     |     |      |      |+TX   |     |                                          |   |          |              
PD9 , // |                              |    |    |     |     |     |      |      |+RX   |     |                                          |   |          |              
PD10, // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PD11, // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PD12, // |                              |    |    |     |     |     |      |      |      |     |*TIM4_CH1                                 |   |          |              
PD13, // |                              |    |    |     |     |     |      |      |      |     |*TIM4_CH2                                 |   |          |              
PD14, // |                              |    |    |     |     |     |      |      |      |     |*TIM4_CH3                                 |   |          |              
PD15, // |                              |    |    |     |     |     |      |      |      |     |*TIM4_CH4                                 |   |          |              
PE0 , // |MEMS_INT1 [L3GD20_INT1]       |    |    |     |     |     |+TX   |      |      |     |+TIM16_CH1                                |   |          |              
PE1 , // |MEMS_INT2 [L3GD20_DRDY/INT2]  |    |    |     |     |     |+RX   |      |      |     |+TIM17_CH1                                |   |          |              
PE2 , // |DRDY [LSM303DLHC_DRDY]        |    |    |     |     |     |      |      |      |     |*TIM3_CH1                                 |   |          |*TRACECK      
PE3 , // |CS_I2C/SPI [L3GD20_CS_I2C/SPI]|    |    |     |     |     |      |      |      |     |*TIM3_CH2                                 |   |          |*TRACED0      
PE4 , // |MEMS_INT3 [LSM303DLHC_INT1]   |    |    |     |     |     |      |      |      |     |*TIM3_CH3                                 |   |          |*TRACED1      
PE5 , // |MEMS_INT4 [LSM303DLHC_INT2]   |    |    |     |     |     |      |      |      |     |*TIM3_CH4                                 |   |          |*TRACED2      
PE6 , // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |*TRACED3      
PE7 , // |                              |    |    |     |     |     |      |      |      |     |                                          |   |          |              
PE8 , // |LD4 [Blue Led]                |    |    |     |     |     |      |      |      |     |+TIM1_CH1N                                |   |          |              
PE9 , // |LD3 [Red Led]                 |    |    |     |     |     |      |      |      |     |*TIM1_CH1                                 |   |          |              
PE10, // |LD5 [Orange Led]              |    |    |     |     |     |      |      |      |     |+TIM1_CH2N                                |   |          |              
PE11, // |LD7 [Green Led]               |    |    |     |     |     |      |      |      |     |*TIM1_CH2                                 |   |          |              
PE12, // |LD9 [Blue Led]                |    |    |     |     |     |      |      |      |     |+TIM1_CH3N                                |   |          |              
PE13, // |LD10 [Red Led]                |    |    |     |     |     |      |      |      |     |*TIM1_CH3                                 |   |          |              
PE14, // |LD8 [Orange Led]              |    |    |     |     |     |      |      |      |     |*TIM1_CH4                                 |   |          |              
PE15, // |LD6 [Green Led]               |    |    |     |     |     |      |      |*RX   |     |                                          |   |          |              
PF0 , // |OSC_IN                        |    |*SDA|     |     |     |      |      |      |     |*TIM1_CH3N                                |   |*OSC_IN   |              
PF1 , // |OSC_OUT                       |    |*SCL|     |     |     |      |      |      |     |                                          |   |*OSC_OUT  |              
PF2 , // |                              |    |    |     |     |     |      |      |      |*IN10|                                          |   |          |              
PF4 , // |                              |    |    |     |     |     |      |      |      |*IN5 |                                          |   |          |              
PF6 , // |                              |    |+SCL|     |     |     |      |      |      |     |+TIM4_CH4                                 |   |          |              
PF9 , // |                              |    |    |     |*SCK |     |      |      |      |     |*TIM15_CH1                                |   |          |              
PF10, // |                              |    |    |     |+SCK |     |      |      |      |     |*TIM15_CH2                                |   |          |              
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD0 , GPIO_PIN_0 , GPIOD, GPIO_PIN_IO, false},
  { PD1 , GPIO_PIN_1 , GPIOD, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PD3 , GPIO_PIN_3 , GPIOD, GPIO_PIN_IO, false},
  { PD4 , GPIO_PIN_4 , GPIOD, GPIO_PIN_IO, false},
  { PD5 , GPIO_PIN_5 , GPIOD, GPIO_PIN_IO, false},
  { PD6 , GPIO_PIN_6 , GPIOD, GPIO_PIN_IO, false},
  { PD7 , GPIO_PIN_7 , GPIOD, GPIO_PIN_IO, false},
  { PD8 , GPIO_PIN_8 , GPIOD, GPIO_PIN_IO, false},
  { PD9 , GPIO_PIN_9 , GPIOD, GPIO_PIN_IO, false},
  { PD10, GPIO_PIN_10, GPIOD, GPIO_PIN_IO, false},
  { PD11, GPIO_PIN_11, GPIOD, GPIO_PIN_IO, false},
  { PD12, GPIO_PIN_12, GPIOD, GPIO_PIN_IO, false},
  { PD13, GPIO_PIN_13, GPIOD, GPIO_PIN_IO, false},
  { PD14, GPIO_PIN_14, GPIOD, GPIO_PIN_IO, false},
  { PD15, GPIO_PIN_15, GPIOD, GPIO_PIN_IO, false},
  { PE0 , GPIO_PIN_0 , GPIOE, GPIO_PIN_IO, false},
  { PE1 , GPIO_PIN_1 , GPIOE, GPIO_PIN_IO, false},
  { PE2 , GPIO_PIN_2 , GPIOE, GPIO_PIN_IO, false},
  { PE3 , GPIO_PIN_3 , GPIOE, GPIO_PIN_IO, false},
  { PE4 , GPIO_PIN_4 , GPIOE, GPIO_PIN_IO, false},
  { PE5 , GPIO_PIN_5 , GPIOE, GPIO_PIN_IO, false},
  { PE6 , GPIO_PIN_6 , GPIOE, GPIO_PIN_IO, false},
  { PE7 , GPIO_PIN_7 , GPIOE, GPIO_PIN_IO, false},
  { PE8 , GPIO_PIN_8 , GPIOE, GPIO_PIN_IO, false},
  { PE9 , GPIO_PIN_9 , GPIOE, GPIO_PIN_IO, false},
  { PE10, GPIO_PIN_10, GPIOE, GPIO_PIN_IO, false},
  { PE11, GPIO_PIN_11, GPIOE, GPIO_PIN_IO, false},
  { PE12, GPIO_PIN_12, GPIOE, GPIO_PIN_IO, false},
  { PE13, GPIO_PIN_13, GPIOE, GPIO_PIN_IO, false},
  { PE14, GPIO_PIN_14, GPIOE, GPIO_PIN_IO, false},
  { PE15, GPIO_PIN_15, GPIOE, GPIO_PIN_IO, false},
  { PF0 , GPIO_PIN_0 , GPIOF, GPIO_PIN_IO, false},
  { PF1 , GPIO_PIN_1 , GPIOF, GPIO_PIN_IO, false},
  { PF2 , GPIO_PIN_2 , GPIOF, GPIO_PIN_IO, false},
  { PF4 , GPIO_PIN_4 , GPIOF, GPIO_PIN_IO, false},
  { PF6 , GPIO_PIN_6 , GPIOF, GPIO_PIN_IO, false},
  { PF9 , GPIO_PIN_9 , GPIOF, GPIO_PIN_IO, false},
  { PF10, GPIO_PIN_10, GPIOF, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOB, 
    .mosi_pin =  GPIO_PIN_15, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_14, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOF, 
    .sck_pin = GPIO_PIN_9, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI3, 
    .mosi_alternate = GPIO_AF6_SPI3,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_12, 
    .miso_alternate = GPIO_AF6_SPI3,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_11, 
    .sck_alternate = GPIO_AF6_SPI3,
    .sck_port = GPIOC, 
    .sck_pin = GPIO_PIN_10, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C1,
    .sda_port = GPIOA,
    .sda_pin = GPIO_PIN_14,
    .scl_alternate = GPIO_AF4_I2C1,
    .scl_port = GPIOA,
    .scl_pin = GPIO_PIN_15,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C2,
    .sda_port = GPIOF,
    .sda_pin = GPIO_PIN_0,
    .scl_alternate = GPIO_AF4_I2C2,
    .scl_port = GPIOF,
    .scl_pin = GPIO_PIN_1,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


uart_conf_t g_uart_config[] = {
  {
    //UART ID and IRQ
    .usart_typedef = USART1, .irqtype = USART1_IRQn,
    .tx_port = GPIOC, .tx_pin = GPIO_PIN_4,
    .rx_port = GPIOC, .rx_pin = GPIO_PIN_5,
    .uart_af_remap = GPIO_AF7_USART1,
    .tx_alternate  = GPIO_AF7_USART1,
    .rx_alternate  = GPIO_AF7_USART1,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART2, .irqtype = USART2_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_2,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_3,
    .uart_af_remap = GPIO_AF7_USART2,
    .tx_alternate  = GPIO_AF7_USART2,
    .rx_alternate  = GPIO_AF7_USART2,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART3, .irqtype = USART3_IRQn,
    .tx_port = GPIOB, .tx_pin = GPIO_PIN_10,
    .rx_port = GPIOE, .rx_pin = GPIO_PIN_15,
    .uart_af_remap = GPIO_AF7_USART3,
    .tx_alternate  = GPIO_AF7_USART3,
    .rx_alternate  = GPIO_AF7_USART3,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
};

uint8_t NB_UART_MANAGED = sizeof(g_uart_config) / sizeof(g_uart_config[0]);

UART_HandleTypeDef g_UartHandle[sizeof(g_uart_config) / sizeof(g_uart_config[0])];


#define SAMPLINGTIME  ADC_SAMPLETIME_1CYCLE_5  /*!< ADC conversions sampling time. */

